app/controllers/contacts_controller.rb

  def create
  	@contact = Contact.new(params[:contact])
  	if @contact.save
---
INSERT INTO `contacts` (`phone`, `name`, `created_at`, `list_number`, `user_id`, `email`, `updated_at`) VALUES('ahskjdhgasd', 'kjasgkjda', '2013-02-09 09:09:08', NULL, NULL, 'lkashjdkasd', '2013-02-09 09:09:08')