app/controllers/lists_controller.rb

SELECT * FROM `contacts` WHERE (`contacts`.`user_id` = 1)
---
	def new
		@list = List.new
		@contacts = Contact.find(:all, :conditions => { :user_id => current_user.id })

SELECT * FROM `contacts` WHERE (`contacts`.`id` IN ('1','2'))
INSERT INTO `lists` (`name`, `created_at`, `user_id`, `updated_at`) VALUES('first', '2013-02-09 09:13:30', 1, '2013-02-09 09:13:30')
---
	def create
		@list = List.new(params[:list])
		@contacts = Contact.find(:all, :conditions => { :id => params[:ids] })
		if @list.save and @contacts.update_all({:list_number => @list.id})

SELECT * FROM `lists` WHERE (`lists`.`id` = 2)
DELETE FROM `lists` WHERE `id` = 2
---
	def destroy
		@list = List.find(params[:id])
		if @list.destroy