app/controllers/surveys_controller.rb

	def create
		@survey = @user.survey.new(params[:survey])
		params[:survey][:survey_breakpoints].each do |sb|
---
SELECT * FROM `survey_breakpoints` WHERE (`survey_breakpoints`.next_survey_breakpoint_id = 7) LIMIT 1

	def show
		@survey = @user.surveys.find_by_name(params[:id])
---
SELECT * FROM `surveys` WHERE (`surveys`.`name` = '1') AND (`surveys`.user_id = 1) LIMIT 1