app/controllers/surveys_controller.rb

	def create
		@survey = @user.surveys.create(params[:survey])
		@prev = nil

		params[:inputs].length.times.each do |count|
			count = count.to_s
			@twiml = parse_xml params[:inputs][count][:question], params[:inputs][count][:options]
			sb = @survey.survey_breakpoints.create :twiml => @twiml
			sb.previous_survey_breakpoint = @prev unless @prev.nil?
			@prev = sb
		end
		@survey.save
---
INSERT INTO `surveys` (`desc`, `name`, `user_id`, `created_at`, `updated_at`, `voice`) VALUES(NULL, 'Hari', 1, '2013-02-09 19:31:55', '2013-02-09 19:31:55', NULL)
INSERT INTO `survey_breakpoints` (`survey_id`, `twiml`, `created_at`, `updated_at`, `next_survey_breakpoint_id`) VALUES(13, 'Q1asd', '2013-02-09 19:41:39', '2013-02-09 19:41:39', NULL)
UPDATE `survey_breakpoints` SET `updated_at` = '2013-02-09 19:42:28', `next_survey_breakpoint_id` = 7 WHERE `id` = 6
UPDATE `users` SET `updated_at` = '2013-02-09 14:33:58', `last_request_at` = '2013-02-09 14:33:58' WHERE `id` = 1

	def show
		@survey = @user.surveys.find(params[:id])
		@breaks = @survey.survey_breakpoints.all
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 18 AND (`surveys`.user_id = 1))
SELECT * FROM `survey_breakpoints` WHERE (`survey_breakpoints`.survey_id = 18) ORDER BY created_at